Public Attributes | List of all members
API_WindowValidatorInfo Struct Reference
Database Manager
Holds information on elements and custom checksums that should be validated for the window. More...
#include <APIdefs_Database.h>
 Public Attributes
 API_Guid  | guid
The GUID of the window.
 GS::Array< API_Guid >  | elemList
List of elements important for the addon.
 GS::Array< MD5::FingerPrint >  | checkSumList
Custom list of checksum to validate along the given elements.
Detailed Description
Holds information on elements and custom checksums that should be validated for the window.
Remarks
This structure is used by the *WindowValidator functions; for further details, refer to these sections.